app/controllers/users_controller.rb

  def home
    @user = User.find(current_user.id)


    @posts = Post.all(:order => "created_at DESC",:conditions => {:receiver_id => current_user.id})
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.`receiver_id` = 1) ORDER BY created_at DESC

  def index                                                                      # listing all users
    @friends = current_user.friends
#    @users = User.find(:all, :conditions => ["id != ? and ",current_user.id,])
    @users = User.find(:all, :conditions => ["id != ?" ,current_user.id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def edit                                                                          #editing a user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 8) LIMIT 1

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2011-04-18 17:02:55', `name` = 'Kausik Bakshi' WHERE `id` = 1

  def add_as_friend
    for fid in params[:friend_ids]
      @friend = Friend.find(:first, :conditions => {:friend_id => fid, :user_id => current_user.id})
      if @friend.blank?
        newfriend = Friend.new
        newfriend.user_id = current_user.id
        newfriend.friend_id = fid
        newfriend.save
---
SELECT * FROM `friends` WHERE (`friends`.`user_id` = 8 AND `friends`.`friend_id` = '1') LIMIT 1
INSERT INTO `friends` (`name`, `created_at`, `updated_at`, `user_id`, `friend_id`) VALUES(NULL, '2011-04-18 16:49:53', '2011-04-18 16:49:53', 8, '1')

  def create

    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `picture_content_type`, `picture_file_name`, `remember_token`, `picture_file_size`, `login`, `email`) VALUES('kausik bakshi', 'c20edb5aaa02169053e8d55caa6fea8278aac4e4', '2011-04-18 16:25:33', 'e3d292b136b32c46238f80cacd2c79b9dca2a73a', NULL, '2011-04-18 16:25:33', 'image/jpeg', '4.jpg', NULL, 1674618, 'kausik', 'kausik@gmail.com')

  def update_picture
   @user = current_user

    puts "Test =========== #{params[:user][:picture]}"
    #if current_user.update_attributes(params[:user])
     if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2011-04-23 06:16:33', `picture_file_size` = 324647, `picture_file_name` = 'Acura Advanced Sedan Concept 02.jpg' WHERE `id` = 9

def onlyshow
  @user = User.find(params[:id])                      #display others profile

  @posts = Post.all(:order => "created_at DESC",:conditions => {:receiver_id => @user.id})
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.`receiver_id` = 1) ORDER BY created_at DESC

def create_comment

#     @post = Post.create(:message => params[:message],:conditions =>{:sender_id=>current_user.id})
      @post = Post.new(:message => params[:message],:sender_id => current_user.id,:receiver_id => params[:post][:receiver_id])
      @post.save
---
INSERT INTO `posts` (`created_at`, `receiver_id`, `updated_at`, `sender_id`, `message`) VALUES('2011-04-18 16:51:14', 1, '2011-04-18 16:51:14', 4, 'hello kausik')